guard-platform-CE/aaa/identity_provider/bootstrap/template/create-idp-google.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mgt="http://mgt.idp.carbon.wso2.org" xmlns:xsd="http://model.common.application.identity.carbon.wso2.org/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <mgt:addIdP>
         <mgt:identityProvider>
            <xsd:displayName>${IDP_NAME}</xsd:displayName>
            <xsd:identityProviderName>${IDP_NAME}</xsd:identityProviderName>
            <xsd:alias>https://${IDP_HOST}/oauth2/token</xsd:alias>
            <xsd:enable>true</xsd:enable>
            <xsd:defaultAuthenticatorConfig>
               <displayName>Google</displayName>
               <name>GoogleOIDCAuthenticator</name>
            </xsd:defaultAuthenticatorConfig>
            <xsd:federatedAuthenticatorConfigs>
               <displayName>Google</displayName>
               <enabled>true</enabled>
               <name>GoogleOIDCAuthenticator</name>
               <properties>
                  <name>ClientId</name>
                  <value>${GOOGLE_CLIENT_ID}</value>
               </properties>
               <properties>
                  <name>ClientSecret</name>
                  <value>${GOOGLE_CLIENT_SECRET}</value>
               </properties>
               <properties>
                  <name>callbackUrl</name>
                  <value>https://${IDP_HOST}/commonauth</value>
               </properties>
               <properties>
                  <name>AdditionalQueryParameters</name>
                  <value>${GOOGLE_OAUTH_SCOPES}</value>
               </properties>
            </xsd:federatedAuthenticatorConfigs>
            <xsd:federationHub>false</xsd:federationHub>
         </mgt:identityProvider>
      </mgt:addIdP>
   </soapenv:Body>
</soapenv:Envelope>
